Emile666/ESP8266_Webserver_W3230/src/W3230-esp8266-server.cpp
/********************************************************************************************
 * This is the ESP8266 Webserver for the W3230 temperature controller.
 ********************************************************************************************/
#include "W3230-esp8266-server.h"
#include <ESP8266WiFi.h>
#include <NTPClient.h>
#include <WiFiUdp.h>
#include <algorithm>

#include "Chart1_html.h"
#include "Chart2_html.h"
#include "Chart3_html.h"

char rs232_buff[BUFLEN];
byte rs232_idx = 0;

// Define NTP Client to get time
WiFiUDP        ntpUDP;
NTPClient      timeClient(ntpUDP, "pool.ntp.org");
AsyncWebServer server(80);

// Search for parameter in HTTP POST request
const char* PARAM_INPUT_1 = "ssid";
const char* PARAM_INPUT_2 = "pass";

//Variables to save values from HTML form
String ssid;
String pass;

struct wifis {
  String  name;
  int32_t rssi;
}; // struct wifis
wifis wifiList[20]; // List with WiFi stations found
byte  numSsid;      // number of WiFi stations found (max. 20)

// File paths to save input values permanently
const char* ssidPath = "/ssid.txt";
const char* passPath = "/pass.txt";

IPAddress localIP;
IPAddress localGateway;
IPAddress subnet(255, 255, 0, 0);

uint16_t  pars[MAXPARAMS];                 // parameter values retrieved from temp controller
uint16_t  prof[MAXPROFILES][PROFILE_SIZE]; // profile data values retrieved from temp controller
uint16_t  count = 0;
uint32_t  numberOfRows=0; // size of array
uint32_t  timeKeeper=0;
int16_t  *t1Data;
int16_t  *t2Data;
int8_t   *hcData;
int16_t  *owData;
uint32_t *timeStamp;
boolean   restart = false;

int16_t  t1,t2,ow;   // Temp1, Temp2, One-Wire Temp
uint8_t  hc;         // heating/cooling
uint16_t sp;         // Setpoint temp
uint32_t freeRAM;    // Amount of free RAM in bytes

//----------------------------------------------------------------------------------
// This is the setup() function for the ESP8266.
//----------------------------------------------------------------------------------
void setup(void)
{
  timeKeeper = millis();
  Serial.begin(57600);

  initFS();

  // Load values saved in LittleFS
  ssid = readFile(LittleFS, ssidPath);
  pass = readFile(LittleFS, passPath);
  Serial.print("Connecting to ");
  Serial.print(ssid);
  Serial.print(" with password ");
  Serial.println(pass);

  if (initWiFi())
  {
    normalWebPages();
    allocateRam();
    Serial.println("p0"); // send request for Profile 0 to temp. controller
    Serial.println("p1"); // send request for Profile 1 to temp. controller
    Serial.println("p2"); // send request for Profile 2 to temp. controller
    Serial.println("p3"); // send request for Profile 3 to temp. controller
    Serial.println("p4"); // send request for Profile 4 to temp. controller
    Serial.println("p5"); // send request for Profile 5 to temp. controller
    Serial.println("p6"); // send request for parameters to temp. controller
  }
  else
  {
    APPages();
  }                   // if
  timeClient.begin(); // Initialize a NTPClient to get time
  // Set offset time in seconds to adjust for your timezone, for example:
  // GMT +1 = 3600
  // GMT +8 = 28800
  // GMT -1 = -3600
  // GMT 0 = 0
  timeClient.setTimeOffset(3600);
  setSyncProvider(syncProvider); // Sync millis() with NTP-time
  timeKeeper = millis() + (POLLPERIOD * 1000);
} // setup()

//----------------------------------------------------------------------------------
// This function executes a single command received via the UART.
//----------------------------------------------------------------------------------
uint8_t execute_single_command(char *s)
{
   const char delim[] = ", ";
   uint8_t    num  = atoi(&s[1]); // convert number in command (until space is found)
   uint8_t    rval = 0;
   uint8_t    i;
   char       s2[40];
   char       *p;
   
   switch (s[0])
   {
     case 'e': 
        if (num > 1) 
           rval = 1;
        else if (!num)
        { // e0: get date & time
          timeClient.update();
          unsigned long epochTime = timeClient.getEpochTime();
          // Get a time structure
          struct tm *ptm = gmtime ((time_t *)&epochTime); 
          sprintf(s2,"e0 %02d-%02d-%4d.",ptm->tm_mday, ptm->tm_mon+1, ptm->tm_year+1900);
          Serial.print(s2);
          Serial.println(timeClient.getFormattedTime());
        } // if
        else timeClient.begin(); // e1: init. again
        break;

     //--------------------------------------------------------
     // The data from the W3230 Temperature Controller is sent
     // Every minute to the ESP8266 via the Serial Port.
     //--------------------------------------------------------
     case 'l':
        hc  = num;                // current state of W3230
        p   = strtok(&s[3],delim); // get the first temp.
        t1  = atoi(p);
        p   = strtok(NULL,delim);  // get the second temp.
        t2  = atoi(p);
        p   = strtok(NULL,delim);  // get the OW-temp.
        ow  = atoi(p);
        p   = strtok(NULL,delim);  // get the setpoint
        sp  = atoi(p);
        break;
        
     //-------------------------------------------------------------------
     // The W3230 Temperature Controller responds to a p0..p6 command
     // (sent in setup()) with a list of values. This is the data 
     // from either the parameters (p6) or from a profile (p0..p5).
     // If any of this data is changed in the W3230, then the profile /
     // parameter data is also sent again and processed here.
     //-------------------------------------------------------------------
     case 'p':
        if (num < MAXPROFILES)   
        {  // One of the profiles
           i = 0;
           p = strtok(&s[3],delim);  // start with first data-value
           prof[num][i++] = atoi(p); // store in profile
           while (i < PROFILE_SIZE)
           {  // save all other data-values
              p              = strtok(NULL,delim);
              prof[num][i++] = atoi(p);
           } // while
        } // if
        else if (num == MAXPROFILES)
        { // The parameter section
           i = 0;
           p = strtok(&s[3],delim);   // start with first data-value
           pars[i++] = atoi(p);       // store in pars[]
           while (i < PROFILE_SIZE)
           {  // save all other data-values
              p         = strtok(NULL,delim);
              pars[i++] = atoi(p);
           } // while
        } // else if
        break;

     case 's': // s0: get version info
        if (!num)
        {
          Serial.println(VERSION);
        } // if
        break;
     default: rval = 1; // ERR
              break;
   } // switch
   return rval; 
} // execute_single_command()

//----------------------------------------------------------------------------------
// This is the main loop() function for the ESP8266.
//----------------------------------------------------------------------------------
void loop(void) {
  if (restart){
    delay(5000);
    ESP.restart();
  } // if
  
