Emile666/ESP8266_Webserver_W3230/src/W3230-esp8266-server.cpp
  if (Serial.available() > 0)
  {
    byte c = Serial.read();
    if ((rs232_idx < sizeof rs232_buff) && (c != '\n'))
    {
      rs232_buff[rs232_idx++] = c;
      if (c == '\r') // (CR,13) end of word
      {
        execute_single_command(rs232_buff);
        rs232_idx = 0;  
      } // if
    } // if
    else rs232_idx = 0; // reset index
  } // if

  freeRAM = system_get_free_heap_size();

  //--------------------------------------
  // Check if poll period has expired
  //--------------------------------------
  if (millis()>=timeKeeper)
  { // Update timeKeeper with the latest time + poll period (multiply by 1000 as millis() is milliseconds)
    timeKeeper = millis() + (POLLPERIOD * 1000);   
    uint32_t currentTime = now();
    if (count < numberOfRows)
    {   // Update each row in the array until it is full
        t1Data[count]    = t1;           // temp1_ntc
        t2Data[count]    = t2;           // temp2_ntc
        owData[count]    = ow;           // ow-temp.
        hcData[count]    = hc;           // Heat/Cool
        timeStamp[count] = currentTime;  //Current time
        count++;
    } // if
    else
	{	  // count >= numberOfRows
      for (uint16_t i = 0; i<numberOfRows-1 ; i++)
      {	// Cycle the array. Move everything forward by one and add the new values to the end
        t1Data[i]    = t1Data[i+1];
        t2Data[i]    = t2Data[i+1];
        owData[i]    = owData[i+1];
        hcData[i]    = hcData[i+1];
        timeStamp[i] = timeStamp[i+1];
      } // for i
      t1Data[numberOfRows-1]    = t1;
      t2Data[numberOfRows-1]    = t2;
      owData[numberOfRows-1]    = ow;
      hcData[numberOfRows-1]    = hc;
      timeStamp[numberOfRows-1] = currentTime;
    } // else
  } // if
} // loop()

//----------------------------------------------------------------------------------
// This function is a Helper function to convert UNIX time to a String.
//----------------------------------------------------------------------------------
void timeAndDate (time_t tt, String& htmlContent ){
 if (hour(tt) < 10) // Add leading-zero if hour is < 10.
      htmlContent += ("0" + String(hour(tt))+ ":");
 else htmlContent += (String(hour(tt)) + ":");
 if (minute(tt) < 10)
      htmlContent += ("0" + String(minute(tt)) + ":");
 else htmlContent += (String(minute(tt)) + ":");
 if (second(tt) < 10)
      htmlContent += ("0" + String(second(tt)) + " ");
 else htmlContent += (String(second(tt)) + " ");
 if (day(tt) < 10)
      htmlContent += ("0" + String(day(tt))+ "/");
 else htmlContent += (String(day(tt)) + "/");
 if (month(tt) < 10)
      htmlContent += ("0" + String(month(tt))+ "/");
 else htmlContent += (String(month(tt)) + "/");
 htmlContent += (String(year(tt)));
} // timeAndDate()

//--------------------------------------------------------------------------------------
// This function allocates sufficient RAM for the data from the temperature controller.
//--------------------------------------------------------------------------------------
void allocateRam(void)
{
  // We will allocate as much RAM as we can to track historical data. 
  // The ALLOCATED_RAM is a safety margin for heap data. The ESP8266 needs at least 10 kB for
  // its web-pages.

  //Get free RAM in bytes
  uint32_t free=system_get_free_heap_size() - ALLOCATED_RAM;
  
  // Divide the free RAM by the size of the variables used to store the data. 
  // This will allow us to work out the maximum number of records we can store. 
  // All while keeping some RAM free which is specified in ALLOCATED_RAM
  numberOfRows = free / (sizeof(uint8_t)*45); // temp1 (2), temp2 (2), HorC (1), One (2), Time (4), each data-line in html (31), spare(3). 
  
  //re-declare the arrays with the number of elements
  t1Data    = new int16_t  [numberOfRows];
  t2Data    = new int16_t  [numberOfRows];
  hcData    = new int8_t   [numberOfRows];
  owData    = new int16_t  [numberOfRows];
  timeStamp = new uint32_t [numberOfRows];

  if ( t1Data==NULL || t2Data==NULL || hcData==NULL || owData==NULL || timeStamp==NULL)
  {
    numberOfRows=0;
    Serial.println("Error in memory allocation!");
  } // if
  else
  {
    Serial.print("Allocated storage for ");
    Serial.print(numberOfRows);
    Serial.println(" data points.");
  } // else
  delay(2000);
} // allocateRam()

//----------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding variables to the gauges on the main web-page.
//----------------------------------------------------------------------------------
String wifiMgrProcessor(const String& var)
{
  String html;
  
  if (var == "PLACEHOLDER1")
  {
    //Here we add the combobox with the sorted WiFi access-points found
    html  = "";
    for (int i = 0; i < numSsid; i++)
    {
      html += "<option value = \"" + wifiList[i].name + "\">"+ wifiList[i].name + " (" + String(wifiList[i].rssi) + " dBm)</option>";
    } // for i
    html += "</select><BR>";
    return html;
  } // if
  return String();
} // wifiMgrProcessor()

//----------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding variables to the gauges on the main web-page.
//----------------------------------------------------------------------------------
String processor(const String& var)
{
  String html, html1;
  
  if (var == "PLACEHOLDER1")
  {
    //Here we loop through the data to place it into the html source code
    html  = "<h3 style=text-align:center;>Free RAM = " + String(freeRAM) + " Bytes</h3>";
    return html;
  } // if
  return String();
} // processor()

//--------------------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding actual data to the parameter input-boxes on the parameters web-page.
//--------------------------------------------------------------------------------------------
String paramProcessor(const String& var)
{
  if (strncmp(var.c_str(),"NR",2) == 0)
  { // Parameter numbers are from NR114 until NR132
     int8_t nr = atoi(var.substring(2).c_str()) - MAXPROFILES*PROFILE_SIZE;
     if ((nr >= 0) && (nr < MAXPARAMS))
     return String(pars[nr]);
  } // if
  return String();
} // paramProcessor()

//--------------------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding actual data to the parameter input-boxes on the parameters web-page.
//--------------------------------------------------------------------------------------------
String profileProcessor(const String& var)
{
  if (strncmp(var.c_str(),"NR",2) == 0)
  { 
     uint8_t nr    = atoi(var.substring(2).c_str());
     uint8_t prNr  = (nr / PROFILE_SIZE); // Profile nr
     uint8_t parNr = (nr % PROFILE_SIZE); // Number within profile
     return String(prof[prNr][parNr]);
  } // if
  return String();
} // profileProcessor()

//----------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding variables to the Temp1 Chart.
//----------------------------------------------------------------------------------
String chart1Processor(const String& var)
{
	String html = "";
	if (var == "PLACEHOLDER1")
	{
	    //Here we loop through the data to place it into the html source code
		for (int i = 0; i< count ; i++)
		{
			html += ("[new Date(" + String(timeStamp[i]) +  "000)," + String(t1Data[i]*0.1) + "]");
		    if (i < count-1) html += ",\n";
		} // for i
		return html;
	} // if
	else if (var == "PLACEHOLDER2")
	{
	    html = ("Number of readings=" + String(count) + "<BR>Max allowed readings=" + String(numberOfRows) + "<BR>");
		//Display the data and time for first and last reading
		html += ("<BR><BR>First reading at : ");
		timeAndDate(timeStamp[0],html);    
    if (count > 1)
    {
      html += ("<BR>Most recent reading : ");
      timeAndDate(timeStamp[count-1],html);     
    } // if
		return html;
	} // else
	return String();
} // chart1Processor()

//----------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding variables to the Temp2 Chart.
//----------------------------------------------------------------------------------
String chart2Processor(const String& var)
{
	String html = "";
	if (var == "PLACEHOLDER1")
	{
	    //Here we loop through the data to place it into the html source code
		for (int i = 0; i< count ; i++)
		{
			html += ("[new Date(" + String(timeStamp[i]) +  "000)," + String(t2Data[i]*0.1) + "]");
		    if (i < count-1) html += ",\n";
		} // for i
		return html;
	} // if
	else if (var == "PLACEHOLDER2")
	{
	    html = ("Number of readings=" + String(count) + "<BR>Max allowed readings=" + String(numberOfRows) + "<BR>");
		//Display the data and time for first and last reading
		html += ("<BR><BR>First reading at : ");
		timeAndDate(timeStamp[0],html);    
    if (count > 1)
    {
      html += ("<BR>Most recent reading : ");
      timeAndDate(timeStamp[count-1],html);     
    } // if
		return html;
	} // else
	return String();
} // chart2Processor()

//----------------------------------------------------------------------------------
// This function replaces the placeholder text in the html source with actual data.
// It is used for adding variables to the Temp-OW Chart.
//----------------------------------------------------------------------------------
String chart3Processor(const String& var)
{
	String html = "";
	if (var == "PLACEHOLDER1")
	{
	    //Here we loop through the data to place it into the html source code
		for (int i = 0; i< count ; i++)
		{
			html += ("[new Date(" + String(timeStamp[i]) +  "000)," + String(hcData[i]) + "]");
		    if (i < count-1) html += ",\n";
		} // for i
		return html;
	} // if
	else if (var == "PLACEHOLDER2")
	{
	    html = ("Number of readings=" + String(count) + "<BR>Max allowed readings=" + String(numberOfRows) + "<BR>");
		//Display the data and time for first and last reading
		html += ("<BR><BR>First reading at : ");
		timeAndDate(timeStamp[0],html);    
    if (count > 1)
    {
      html += ("<BR>Most recent reading : ");
      timeAndDate(timeStamp[count-1],html);     
    } // if
		return html;
	} // else
	return String();
} // chart3Processor()

//----------------------------------------------------------------------------------
// This function syncs the internal time with the time from the time-server.
//----------------------------------------------------------------------------------
time_t syncProvider(void)
{
  timeClient.update();
  return timeClient.getEpochTime();
} // syncProvider()

//----------------------------------------------------------------------------------
// This function initializes the ESP8266 File-system, which is LittleFS.
//----------------------------------------------------------------------------------
void initFS(void) 
{
  Serial.print("\nMounting LittleFS:");
  if (!LittleFS.begin()) {
    Serial.println("Error.");
  } // if
  else{
    Serial.println("OK.");
  } // else
} // initFS()

//----------------------------------------------------------------------------------
// This function reads a File from LittleFS.
//----------------------------------------------------------------------------------
String readFile(fs::FS &fs, const char * path){
  Serial.printf("Reading file: %s\r\n", path);

  File file = fs.open(path, "r");
  if(!file || file.isDirectory()){
    Serial.println("- failed to open file for reading");
    return String();
  }

  String fileContent;
  while(file.available()){
    fileContent = file.readStringUntil('\n');
    break;
  }
  file.close();
  return fileContent;
} // readFile()

//----------------------------------------------------------------------------------
// This function writes a file to LittleFS.
//----------------------------------------------------------------------------------
void writeFile(fs::FS &fs, const char * path, const char * message)
{
  Serial.printf("Writing file: %s\r\n", path);

  File file = fs.open(path, "w");
  if(!file){
    Serial.println("- failed to open file for writing");
    return;
  }
  if(file.print(message)){
    Serial.println("- file written");
  } else {
    Serial.println("- write failed");
  }
  file.close();
} // writeFile()

//----------------------------------------------------------------------------------
// This function initializes WiFi
//----------------------------------------------------------------------------------
bool initWiFi(void) 
{
  if (ssid=="" || pass==""){
    Serial.println("Undefined SSID or password");
    return false;
  } // if

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), pass.c_str());
  if (WiFi.waitForConnectResult() != WL_CONNECTED){
    Serial.println("WiFi Failed!");
    return false;
  } // if
  Serial.println();
  Serial.print("WiFi Connected, IP Address: ");
  Serial.println(WiFi.localIP());
  return true;
} // initWiFi()

//----------------------------------------------------------------------------------
// This function is executed when a web-page is not found.
//----------------------------------------------------------------------------------
void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "Not found");
} // notFound()

//----------------------------------------------------------------------------------
// This function initializes the normal web-pages.
//----------------------------------------------------------------------------------
void normalWebPages(void) 
{
  //---------------------------------------------
  // Send web page with input fields to client
  //---------------------------------------------
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    //request->send_P(200, "text/html", htmlPage1, processor);
	request->send(LittleFS, "/index.html", "text/html", false, processor);
  });

