Emile666/ESP8266_Webserver_W3230/src/W3230-esp8266-server.cpp
  server.serveStatic("/", LittleFS, "/");

  //-----------------------
  // Parameters Page
  //-----------------------
  server.on("/page2", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/params.html", "text/html", false, paramProcessor);
  });

  //-----------------------
  // Profile Pr0 Page
  //-----------------------
  server.on("/page3", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile0.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // Profile Pr1 Page
  //-----------------------
  server.on("/page4", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile1.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // Profile Pr2 Page
  //-----------------------
  server.on("/page5", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile2.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // Profile Pr3 Page
  //-----------------------
  server.on("/page6", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile3.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // Profile Pr4 Page
  //-----------------------
  server.on("/page7", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile4.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // Profile Pr5 Page
  //-----------------------
  server.on("/page8", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/profile5.html", "text/html", false, profileProcessor);
  });

  //-----------------------
  // /data.json Page
  //-----------------------
  server.on("/data.json", HTTP_GET, [](AsyncWebServerRequest *request){
    String html;
    html  = ("{\"T1\":\"" + String(t1*0.1)  + "\",\"T2\":\""   + String(t2*0.1) + "\",\"HeatCool\":\"" + String(hc) + "\",");
    html += ("\"SP\":\"" + String(sp*0.1) + "\",\"OW1\":\"" + String(ow*0.1) + "\"}");
    request->send_P(200, "application/json", html.c_str());
  });

  //-----------------------
  // /chart1.html Page
  //-----------------------
  server.on("/chart1.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send_P(200, "text/html", chart1_html, chart1Processor);
  });
  
  //-----------------------
  // /chart2.html Page
  //-----------------------
  server.on("/chart2.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send_P(200, "text/html", chart2_html, chart2Processor);
  });

  //-----------------------
  // /chart3.html Page
  //-----------------------
  server.on("/chart3.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send_P(200, "text/html", chart3_html, chart3Processor);
  });

  // Send a GET request to <ESP_IP>/get?input1=<inputMessage>
  server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String  inputMessage;
    String  inputParam;
    String  parName;
    int     i = 0;
    int16_t oldVal;

    while (i < TOTALPARS)
    { // GET input value on <ESP_IP>/get?inputx=<inputMessage>
      parName = "nr" + String(i);
      uint8_t prNr    = (i / PROFILE_SIZE); // Profile nr, 6 = parameters
      uint8_t parNr   = (i % PROFILE_SIZE); // Number within profile
      if (request->hasParam(parName)) 
      {
        int16_t parVal = request->getParam(parName)->value().toInt();
        inputMessage   = "v" + String(i) + " " + String(parVal); // value
        if (i < PROFILE_SIZE*MAXPROFILES)
        { // One of the Profile parameters
          oldVal = prof[prNr][parNr];
          if (oldVal != parVal) Serial.println(inputMessage);
          prof[prNr][parNr] = parVal;
        } // if
        else 
        { // One of the Parameters
          oldVal = pars[parNr];
          if (oldVal != parVal) Serial.println(inputMessage);
          pars[parNr] = parVal;
        } // else
      } // if
      i++;
    } // while    
    request->send(LittleFS, "/index.html", "text/html", false, processor); // Back to Home Page
  });

  server.onNotFound(notFound);
  server.begin();
  Serial.println("HTTP Server started");
} // normalWebPages()

//----------------------------------------------------------------------------------
// This function initializes the web-pages for the Wifi-Manager.
//----------------------------------------------------------------------------------
void APPages(void)
{
    // Connect to Wi-Fi network with SSID and password
    Serial.println("Setting AP (Access Point)");
    // NULL sets an open Access Point
    WiFi.softAP("W3230-WIFI-MANAGER", NULL);

    IPAddress IP = WiFi.softAPIP();
    Serial.print("AP IP address: ");
    Serial.println(IP); 
    
    numSsid = WiFi.scanNetworks();
    if (numSsid > 20) numSsid = 20;

    // print the network number and name for each network found:
    for (int i = 0; i<numSsid; i++) 
    {
      //char s[10];
      //sprintf(s,"%02d) ",i);
      //Serial.print(s);
      //Serial.print(WiFi.SSID(i));
      //Serial.print(", ");
      //Serial.print(WiFi.RSSI(i));
      //Serial.println(" dBm");
      wifiList[i].name = WiFi.SSID(i);
      wifiList[i].rssi = WiFi.RSSI(i);
    } // for i
    std::sort(wifiList,wifiList+numSsid,[] (const wifis &wifi1, const wifis &wifi2)
    {
      if (wifi1.rssi > wifi2.rssi) return true;
      else if (wifi1.rssi == wifi2.rssi)
      {
        if (wifi1.name > wifi2.name) return true;
      } // else if
      return false;
    });

    // Web Server Root URL
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(LittleFS, "/wifimanager.html", "text/html", false, wifiMgrProcessor);
    });
    
    server.serveStatic("/", LittleFS, "/");
    
    server.on("/", HTTP_POST, [](AsyncWebServerRequest *request) 
    {
      int params = request->params();
      for (int i=0;i<params;i++)
      {
        AsyncWebParameter* p = request->getParam(i);
        if(p->isPost()){
          // HTTP POST ssid value
          if (p->name() == PARAM_INPUT_1) 
          {
            ssid = p->value().c_str();
            Serial.print("SSID set to: ");
            Serial.println(ssid);
            // Write file to save value
            writeFile(LittleFS, ssidPath, ssid.c_str());
          } // if
          // HTTP POST pass value
          if (p->name() == PARAM_INPUT_2) 
          {
            pass = p->value().c_str();
            Serial.print("Password set to: ");
            Serial.println(pass);
            // Write file to save value
            writeFile(LittleFS, passPath, pass.c_str());
          } // if
          //Serial.printf("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
        } // if
      } // for i
      restart = true;
      request->send(200, "text/plain", "Done. ESP will restart, connect to your router and check IP address.");
    }); // server.on()
    server.begin();
} // APPages()
  
